data_assignment/foam_cases/base_of_case/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    Inlet
    {
        type            fixedValue;
        value           uniform 101325;
    }
    
    
    Outlet
    {
        type fixedValue;
        value uniform 101325;
    }
    
    Airfoil
    {
        type zeroGradient;
    }
    
    Flap
    {
        type zeroGradient;
    }
    
    Side
    {
        type empty;
    }
}


// ************************************************************************* //
