data_assignment/foam_cases/base_of_case/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    Inlet
    {
        type            fixedValue;
        value uniform 295.005586631;
    }
    
    Outlet
    {
        type zeroGradient;
    }

    Airfoil
    {
        type            zeroGradient;
    }
    
    Flap
    {
        type            zeroGradient;
    }
    
    Side
    {
        type            empty;
    }
    
}


// ************************************************************************* //
